{
  "activation_function": "gelu_new",
  "architectures": [
    "GPTNeoForCausalLM"
  ],
  "attention_dropout": 0.0,
  "attention_layers": [
    "global",
    "global",
    "global",
    "global"
  ],
  "attention_types": [
    [
      [
        "global"
      ],
      4
    ]
  ],
  "bos_token_id": 50256,
  "classifier_dropout": 0.1,
  "dtype": "float32",
  "embed_dropout": 0.0,
  "eos_token_id": 50256,
  "hidden_size": 128,
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "layer_norm_epsilon": 1e-05,
  "max_position_embeddings": 256,
  "model_type": "gpt_neo",
  "num_heads": 4,
  "num_layers": 4,
  "pad_token_id": null,
  "resid_dropout": 0.0,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "use_cache": false,
  "vocab_size": 50257,
  "window_size": 32
}
